[
    {
        "id": "lanzamiento-nivel-codigo-gamified",
        "title": " Level Up Code: El Juego de Programaci贸n en la Vida Real",
        "date": "2026-01-15",
        "author": "Edisson Giraldo",
        "summary": "Esto no es solo un blog, es un MMORPG educativo. Desbloquea niveles, completa misiones y 煤nete a la 'resistencia' tecnol贸gica.",
        "content": "<h2>Bienvenido Jugador 1</h2><p>Hemos gamificado el aprendizaje. En <strong>Level Up Code</strong>, no eres un estudiante pasivo; eres un jugador activo en una misi贸n colectiva para desbloquear el conocimiento avanzado.</p><h3>驴C贸mo Funciona el Juego?</h3><p>Todo nuestro contenido est谩 estructurado por niveles de acceso progresivo:</p><ul><li><strong> Nivel 0 (Tutorial/Demo):</strong> Acceso GRATUITO y abierto para todos. Aprende los fundamentos esenciales de todas las series (Web, IoT, L贸gica).</li><li><strong> Nivel 1 (Misi贸n de Comunidad):</strong> Se desbloquea al alcanzar los <strong>1,000 Suscriptores</strong>. Contenido intermedio: JavaScript real, sensores avanzados y algoritmos de b煤squeda.</li><li><strong> Nivel 2 (Misi贸n pica):</strong> Se libera a los <strong>5,000 Suscriptores</strong>. Proyectos complejos como Dashboards con APIs reales y Estaciones Meteorol贸gicas IoT.</li><li><strong> Nivel 3 (Maestr铆a):</strong> Reservado para la 茅lite de los 10,000 Subs. Arquitectura de software y despliegues profesionales.</li></ul><h3>El 'Cheat Code' (Atajo)</h3><p>驴Eres impaciente? Los miembros del canal y Patreons tienen acceso <strong>INMEDIATO</strong> a todos los niveles sin esperar las metas comunitarias. T煤 decides tu estilo de juego: cooperativo o speedrun.</p><div style='text-align:center; margin: 30px 0;'><a href='https://www.youtube.com/@SolveAI-om8hd' target='_blank' style='background-color: #7289da; color: white; padding: 15px 30px; text-decoration: none; border-radius: 5px; font-weight: bold; display: inline-flex; align-items: center; gap: 10px;'><span></span> Unirse a la Partida en YouTube</a></div>",
        "tags": [
            "Comunidad",
            "Gamificaci贸n",
            "Noticias"
        ],
        "image": "img/logooriginal.png"
    },
    {
        "id": "ruta-iot-red-series",
        "title": " Red Series: Domina el Hardware (IoT)",
        "date": "2026-01-16",
        "author": "Edisson Giraldo",
        "summary": "De encender un LED a crear sistemas de seguridad. Una ruta pr谩ctica con Arduino y ESP32.",
        "content": "<h2>Tu Pasaporte al Mundo F铆sico</h2><p>En la <strong>Red Series</strong>, dejamos de programar pantallas para programar la realidad. Utilizando plataformas como Arduino y ESP32, aprender谩s a construir dispositivos que sienten y act煤an.</p><h3>Mapa de Niveles</h3><ul><li><strong>Nivel 0: Los Cimientos.</strong> Entiende el voltaje y la corriente. Proyecto: <em>Hola Mundo (LED Blink)</em> y control con pulsadores.</li><li><strong>Nivel 1: Primeros Inventos.</strong> Sensores de luz y temperatura. Proyecto: <em>Mood Lamp (L谩mpara de Ambiente)</em> con LEDs RGB y algoritmos de color.</li><li><strong>Nivel 2: Sensores Avanzados.</strong> Medici贸n precisa con DHT11/22 y HC-SR04. Proyectos: <em>Metro Digital</em> y <em>Estaci贸n Meteorol贸gica</em>.</li><li><strong>Caso de Estudio: Halloween.</strong> Un sistema completo de sustos automatizado que usa sensores ultras贸nicos para detectar intrusos y activar efectos de luz y sonido (WAV) con un m贸dulo DFPlayer Mini.</li></ul><p>Descarga nuestros diagramas de conexi贸n y c贸digos de ejemplo directamente del Hub.</p>",
        "tags": [
            "IoT",
            "Arduino",
            "ESP32",
            "Hardware"
        ],
        "image": "img/ledIOT.png"
    },
    {
        "id": "ruta-web-blue-series",
        "title": " Blue Series: Arquitectura Web Moderna",
        "date": "2026-01-17",
        "author": "Edisson Giraldo",
        "summary": "No uses plantillas. Convi茅rtete en Arquitecto Web. Desde HTML Sem谩ntico hasta SPAs con JavaScript.",
        "content": "<h2>Construye el Internet</h2><p>La <strong>Blue Series</strong> es para quienes quieren entender la web a profundidad, no solo copiar y pegar c贸digo. Nos enfocamos en est谩ndares modernos, accesibilidad y rendimiento.</p><h3>Syllabus del Curso</h3><ul><li><strong>Nivel 0: Estructura y Estilo.</strong> HTML5 Sem谩ntico real (header, main, footer). CSS avanzado con Flexbox y Grid. <strong>Proyecto:</strong> <em>Landing Page Personal Responsiva</em> desplegada en GitHub Pages.</li><li><strong>Nivel 1: Interactividad.</strong> L贸gica de programaci贸n en JS, manipulaci贸n del DOM y Eventos. <strong>Proyecto:</strong> <em>Generador de Contrase帽as / To-Do List</em>.</li><li><strong>Nivel 2: Aplicaciones Din谩micas.</strong> Consumo de APIs (Fetch/Async-Await), JSON y manejo de estado. <strong>Proyecto:</strong> <em>Dashboard de Clima o Buscador de Pel铆culas</em>.</li><li><strong>Nivel 3: Componentes.</strong> Arquitectura basada en componentes reutilizables y gesti贸n de estado global para un <em>Mini E-commerce</em>.</li></ul>",
        "tags": [
            "Web",
            "Frontend",
            "JavaScript",
            "CSS"
        ],
        "image": "img/bannerweb.png"
    },
    {
        "id": "ruta-logic-green-series",
        "title": " Green Series: L贸gica y Algoritmos (Python)",
        "date": "2026-01-18",
        "author": "Edisson Giraldo",
        "summary": "Hackea el sistema. Entrena tu cerebro con Python, diagramas de flujo y retos de algoritmos.",
        "content": "<h2>El Gimnasio para tu Cerebro</h2><p>Aprender un lenguaje es f谩cil; aprender a <strong>pensar</strong> como programador es el verdadero reto. La <strong>Green Series</strong> utiliza Python como veh铆culo para ense帽arte fundamentos de ingenier铆a de software.</p><h3>Contenido del Entrenamiento</h3><ul><li><strong>Pensamiento L贸gico:</strong> Tablas de verdad, operadores booleanos y diagramas de flujo que se resuelven solos.</li><li><strong>Python B谩sico:</strong> Tipos de datos, 'Control Flow' (if, for, while) y modularizaci贸n con funciones.</li><li><strong>Estructuras de Datos:</strong> Listas, diccionarios y tuplas. Entiende c贸mo organizar la informaci贸n en memoria.</li><li><strong>Algoritmos Cl谩sicos:</strong> B煤squeda Lineal vs Binaria, y algoritmos de ordenamiento (Burbuja, Selecci贸n). An谩lisis intuitivo de complejidad Big-O.</li><li><strong>Retos:</strong> Calculadoras CLI, juegos de texto y automatizaci贸n de tareas aburridas.</li></ul><p><em>'A los 1000 suscriptores, liberamos el c贸digo fuente avanzado del Nivel 1.'</em></p>",
        "tags": [
            "L贸gica",
            "Python",
            "Algoritmos",
            "Backend"
        ],
        "image": "img/logica2.png"
    }
]